:piechart: Mermaid diagrams
